import {
  FaqPageTitle,
  FaqPageWrapper,
  FaqAccordion,
  FaqAccordionDetails,
  AccordionList,
  FaqAccordionTitle,
  FaqAccordionText,
  FaqAccordionSummary,
} from './FaqPageComponent.styled';
import ExpandIcon from '../../components/ExpandIcon';
import { useSidebarContext } from '../../common/Sidebar/SidebarContext';

const titlesAndTexts = [
  {
    title: 'Як заблокувати повідомлення?',
    /* eslint-disable */
    text: 'У налаштуванні повідомлення можна вибрати пункт “Поскаржитися”. Після того, як три різні користувачі поскаржаться на повідомлення, воно буде автоматично видалене із чату.',
  },
  {
    title: 'Як додати тег?',
    text: 'Теги можна додавати лише при створенні нової теми, від 1 тегу і більше, але користуємось здоровим глуздом при додаванні нових тегів. Тег може мати від 2 до 30 символів, містити великі і маленькі літери кирилиці та латинські, цифри та спеціальні символи такі як: «#» і «_».',
  },
  {
    title: 'Як поскаржитись на тему?',
    text: 'У налаштуванні теми можна вибрати пункт “Поскаржитися”. Після того, як користувач поскаржиться на тему, вона в нього зникне із списку всіх тем.',
  },
  {
    title: 'Як забанити повідомлення?',
    text: 'У налаштуванні повідомлення можна вибрати пункт “Поскаржитися”. Після того, як три різні користувачі поскаржаться на повідомлення, воно буде автоматично видалене із чату.',
  },
  {
    title: 'Дозвіл отримання особистих повідомлень',
    text: 'У налаштуваннях можна виключити дозвіл на отримання особистих повідомлень. При виключенні дозволу ніхто із інших користувачів застосунку не зможе написати вам особисте повідомлення. Для того щоб мати змогу отримувати особисті повідомлення потрібно в налаштуваннях включити дозвіл знову.',
  },
  {
    title: 'Як знайти тему?',
    text: 'У полі пошуку можна ввести назву теми, яку шукаєте або тег цієї теми та натиснути пошук.',
  },
  {
    title: 'Як вимкнути нотифікації?',
    text: 'У налаштуваннях можна вимкнути звуковий супровід нових повідомлень. Якщо хочете знову отримувати звукові сповіщення то включіть їх знову у налаштуваннях.',
  },
  {
    title: 'Як написати іншому користувачу?',
    text: 'В списку користувачів теми можна написати будь-якому користувачу у якого активний дозвіл на отримання особистих повідомлень. У таких користувачів є іконка листа.',
  },
  {
    title: 'Як створити нову тему?',
    text: `Для того, щоб створити нову тему для обговорення, натисність на кнопку “Нова”, заповніть поля вводу на формі та натисніть “Створити”. Все, ваша тема створена.
Ім’я нової теми може мати від 2 до 70 символів, містити великі і маленькі літери кирилиці та латинські, цифри та спеціальні символи такі як: ! % : _ - + = ?. ( )
При створенні нової теми потрібно додати тег, мінімально 1 тег, максимальної кількості немає, проте, будь ласка, керуємося здоровим глуздом, коли додаємо теги. Теги можна додавати лише при створенні нової теми. Тег може мати від 2 до 30 символів, містити великі і маленькі літери кирилиці та латинські, цифри та спеціальні символи такі як: «#» і «_».`,
  },
];

function FaqPageComponent() {
  const { showAdvancedMenu } = useSidebarContext();
  return (
    showAdvancedMenu && (
      <FaqPageWrapper>
        <FaqPageTitle variant="h2">Найпоширеніші питання</FaqPageTitle>
        <AccordionList>
          {titlesAndTexts.map(({ title, text }, index) => (
            <FaqAccordion key={index}>
              <FaqAccordionSummary expandIcon={<ExpandIcon />}>
                <FaqAccordionTitle variant="h5">{title}</FaqAccordionTitle>
              </FaqAccordionSummary>
              <FaqAccordionDetails>
                <FaqAccordionText variant="h5">{text}</FaqAccordionText>
              </FaqAccordionDetails>
            </FaqAccordion>
          ))}
        </AccordionList>
      </FaqPageWrapper>
    )
  );
}

export default FaqPageComponent;
